CSI API ETABS v1
cGridSys.ChangeName Method
 Changes the name of a defined grid system.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ChangeName(
	string Name,
	string NewName
)
Function ChangeName (
	Name As String,
	NewName As String
) As Integer
Dim instance As cGridSys
Dim Name As String
Dim NewName As String
Dim returnValue As Integer
returnValue = instance.ChangeName(Name,
	NewName)
int ChangeName(
	String^ Name,
	String^ NewName
)
abstract ChangeName :
        Name : string *
        NewName : string -> int
Parameters
Name
Type: System.String
 The existing name of a defined grid system.
NewName
Type: System.String
 The new name for the grid system.
Return Value
Type: Int32
 Returns zero if the new name is successfully applied, otherwise it returns a nonzero value.
Remarks
 Changing the name of the Global grid system will fail and return an error.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new grid system
   ret = SapModel.GridSys.SetGridSys("GridSysA", 1000, 1000, 0, 0, 0, 0)
'change name of new grid system
   ret = SapModel.GridSys.ChangeName("GridSysA", "MyChangedCSysA")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cGridSys Interface
ETABSv1 Namespace